tap "homebrew/bundle"
tap "homebrew/core"
tap "github/gh"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# HTTP tunnel
brew "corkscrew"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Git author stats
brew "git-quick-stats"
# Improved top (interactive process viewer)
brew "htop"
# Text-to-HTML conversion tool
brew "markdown"
# Handy rename util
brew "rename"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Repeat and correct command typos
brew "thefuck"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Internet file retriever
brew "wget"
