tap "homebrew/bundle"
tap "homebrew/core"
tap "microsoft/git"

cask_args appdir: "~/Applications"

cask "git-credential-manager-core"
cask "phoenix"
cask "jetbrains-toolbox"
cask "firefox"
cask "spotify"

brew "azure-cli"
brew "bash"
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
brew "colordiff"
brew "coreutils"
# HTTP tunnel
brew "corkscrew"
brew "curl"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "htop"
# JSON parser
brew "jq"
brew "markdown"
brew "rename"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Repeat and correct command typos
brew "thefuck"
# Code-search similar to ack
brew "the_silver_searcher"
brew "tree"
brew "vim"
brew "wget"
